Dlubal.RFEM5.IProtocols
Interface for working with printout reports.

Dlubal.RFEM5.IProtocols.GetProtocolCount
Gets count of all available printout reports in the model.
Returns: Count of printout reports in the model.

Dlubal.RFEM5.IProtocols.GetProtocol(System.Int32,System.UInt32)
Gets the printout report interface at the specified index or with the specified No.
Returns: Protocol interface.
No: Number or index of the printout report you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IProtocols.GetProtocols
Gets array of basic information about all available printout reports.
Returns: Array of basic information of all available printout reports.